; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	image1 - mode
	spectrograph0 - mode
	infrared2 - mode
	Star1 - direction
	GroundStation2 - direction
	Star0 - direction
	Star3 - direction
	Phenomenon4 - direction
	Phenomenon5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 infrared2)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star0)
	(supports instrument1 spectrograph0)
	(supports instrument1 infrared2)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 image1)
	(supports instrument2 spectrograph0)
	(supports instrument2 infrared2)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 157)
	(supports instrument3 spectrograph0)
	(supports instrument3 infrared2)
	(supports instrument3 image1)
	(calibration_target instrument3 Star0)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 Star0)
	(supports instrument5 infrared2)
	(calibration_target instrument5 Star0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon10)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 187)
	(= (data Star3 image1) 224)
	(= (data Phenomenon4 image1) 67)
	(= (data Phenomenon5 image1) 55)
	(= (data Star6 image1) 210)
	(= (data Phenomenon7 image1) 188)
	(= (data Planet8 image1) 172)
	(= (data Planet9 image1) 300)
	(= (data Phenomenon10 image1) 113)
	(= (data Planet11 image1) 77)
	(= (data Star3 spectrograph0) 202)
	(= (data Phenomenon4 spectrograph0) 205)
	(= (data Phenomenon5 spectrograph0) 84)
	(= (data Star6 spectrograph0) 30)
	(= (data Phenomenon7 spectrograph0) 7)
	(= (data Planet8 spectrograph0) 37)
	(= (data Planet9 spectrograph0) 239)
	(= (data Phenomenon10 spectrograph0) 168)
	(= (data Planet11 spectrograph0) 91)
	(= (data Star3 infrared2) 286)
	(= (data Phenomenon4 infrared2) 207)
	(= (data Phenomenon5 infrared2) 176)
	(= (data Star6 infrared2) 167)
	(= (data Phenomenon7 infrared2) 242)
	(= (data Planet8 infrared2) 199)
	(= (data Planet9 infrared2) 130)
	(= (data Phenomenon10 infrared2) 41)
	(= (data Planet11 infrared2) 276)
	(= (slew_time Star1 Star0) 23.59)
	(= (slew_time Star0 Star1) 23.59)
	(= (slew_time GroundStation2 Star0) 50.02)
	(= (slew_time Star0 GroundStation2) 50.02)
	(= (slew_time GroundStation2 Star1) 38.94)
	(= (slew_time Star1 GroundStation2) 38.94)
	(= (slew_time Star3 Star0) 72.14)
	(= (slew_time Star0 Star3) 72.14)
	(= (slew_time Star3 Star1) 3.798)
	(= (slew_time Star1 Star3) 3.798)
	(= (slew_time Star3 GroundStation2) 46.45)
	(= (slew_time GroundStation2 Star3) 46.45)
	(= (slew_time Phenomenon4 Star0) 5.506)
	(= (slew_time Star0 Phenomenon4) 5.506)
	(= (slew_time Phenomenon4 Star1) 44.9)
	(= (slew_time Star1 Phenomenon4) 44.9)
	(= (slew_time Phenomenon4 GroundStation2) 49.63)
	(= (slew_time GroundStation2 Phenomenon4) 49.63)
	(= (slew_time Phenomenon4 Star3) 23.93)
	(= (slew_time Star3 Phenomenon4) 23.93)
	(= (slew_time Phenomenon5 Star0) 7.207)
	(= (slew_time Star0 Phenomenon5) 7.207)
	(= (slew_time Phenomenon5 Star1) 51.79)
	(= (slew_time Star1 Phenomenon5) 51.79)
	(= (slew_time Phenomenon5 GroundStation2) 11.08)
	(= (slew_time GroundStation2 Phenomenon5) 11.08)
	(= (slew_time Phenomenon5 Star3) 19.68)
	(= (slew_time Star3 Phenomenon5) 19.68)
	(= (slew_time Phenomenon5 Phenomenon4) 6.732)
	(= (slew_time Phenomenon4 Phenomenon5) 6.732)
	(= (slew_time Star6 Star0) 21.61)
	(= (slew_time Star0 Star6) 21.61)
	(= (slew_time Star6 Star1) 20.3)
	(= (slew_time Star1 Star6) 20.3)
	(= (slew_time Star6 GroundStation2) 52.05)
	(= (slew_time GroundStation2 Star6) 52.05)
	(= (slew_time Star6 Star3) 92.1)
	(= (slew_time Star3 Star6) 92.1)
	(= (slew_time Star6 Phenomenon4) 25.67)
	(= (slew_time Phenomenon4 Star6) 25.67)
	(= (slew_time Star6 Phenomenon5) 94.64)
	(= (slew_time Phenomenon5 Star6) 94.64)
	(= (slew_time Phenomenon7 Star0) 8.036)
	(= (slew_time Star0 Phenomenon7) 8.036)
	(= (slew_time Phenomenon7 Star1) 37.46)
	(= (slew_time Star1 Phenomenon7) 37.46)
	(= (slew_time Phenomenon7 GroundStation2) 4.315)
	(= (slew_time GroundStation2 Phenomenon7) 4.315)
	(= (slew_time Phenomenon7 Star3) 15.67)
	(= (slew_time Star3 Phenomenon7) 15.67)
	(= (slew_time Phenomenon7 Phenomenon4) 44.35)
	(= (slew_time Phenomenon4 Phenomenon7) 44.35)
	(= (slew_time Phenomenon7 Phenomenon5) 28.34)
	(= (slew_time Phenomenon5 Phenomenon7) 28.34)
	(= (slew_time Phenomenon7 Star6) 3.903)
	(= (slew_time Star6 Phenomenon7) 3.903)
	(= (slew_time Planet8 Star0) 48.8)
	(= (slew_time Star0 Planet8) 48.8)
	(= (slew_time Planet8 Star1) 40.24)
	(= (slew_time Star1 Planet8) 40.24)
	(= (slew_time Planet8 GroundStation2) 31.79)
	(= (slew_time GroundStation2 Planet8) 31.79)
	(= (slew_time Planet8 Star3) 2.826)
	(= (slew_time Star3 Planet8) 2.826)
	(= (slew_time Planet8 Phenomenon4) 66.64)
	(= (slew_time Phenomenon4 Planet8) 66.64)
	(= (slew_time Planet8 Phenomenon5) 0.1304)
	(= (slew_time Phenomenon5 Planet8) 0.1304)
	(= (slew_time Planet8 Star6) 36.73)
	(= (slew_time Star6 Planet8) 36.73)
	(= (slew_time Planet8 Phenomenon7) 71.45)
	(= (slew_time Phenomenon7 Planet8) 71.45)
	(= (slew_time Planet9 Star0) 31.32)
	(= (slew_time Star0 Planet9) 31.32)
	(= (slew_time Planet9 Star1) 62.37)
	(= (slew_time Star1 Planet9) 62.37)
	(= (slew_time Planet9 GroundStation2) 20.04)
	(= (slew_time GroundStation2 Planet9) 20.04)
	(= (slew_time Planet9 Star3) 37.27)
	(= (slew_time Star3 Planet9) 37.27)
	(= (slew_time Planet9 Phenomenon4) 53.4)
	(= (slew_time Phenomenon4 Planet9) 53.4)
	(= (slew_time Planet9 Phenomenon5) 11.37)
	(= (slew_time Phenomenon5 Planet9) 11.37)
	(= (slew_time Planet9 Star6) 18.06)
	(= (slew_time Star6 Planet9) 18.06)
	(= (slew_time Planet9 Phenomenon7) 27.77)
	(= (slew_time Phenomenon7 Planet9) 27.77)
	(= (slew_time Planet9 Planet8) 58.75)
	(= (slew_time Planet8 Planet9) 58.75)
	(= (slew_time Phenomenon10 Star0) 63.31)
	(= (slew_time Star0 Phenomenon10) 63.31)
	(= (slew_time Phenomenon10 Star1) 3.17)
	(= (slew_time Star1 Phenomenon10) 3.17)
	(= (slew_time Phenomenon10 GroundStation2) 12.14)
	(= (slew_time GroundStation2 Phenomenon10) 12.14)
	(= (slew_time Phenomenon10 Star3) 50.23)
	(= (slew_time Star3 Phenomenon10) 50.23)
	(= (slew_time Phenomenon10 Phenomenon4) 4.01)
	(= (slew_time Phenomenon4 Phenomenon10) 4.01)
	(= (slew_time Phenomenon10 Phenomenon5) 70.69)
	(= (slew_time Phenomenon5 Phenomenon10) 70.69)
	(= (slew_time Phenomenon10 Star6) 42.48)
	(= (slew_time Star6 Phenomenon10) 42.48)
	(= (slew_time Phenomenon10 Phenomenon7) 51.59)
	(= (slew_time Phenomenon7 Phenomenon10) 51.59)
	(= (slew_time Phenomenon10 Planet8) 33.68)
	(= (slew_time Planet8 Phenomenon10) 33.68)
	(= (slew_time Phenomenon10 Planet9) 38.15)
	(= (slew_time Planet9 Phenomenon10) 38.15)
	(= (slew_time Planet11 Star0) 5.919)
	(= (slew_time Star0 Planet11) 5.919)
	(= (slew_time Planet11 Star1) 40.98)
	(= (slew_time Star1 Planet11) 40.98)
	(= (slew_time Planet11 GroundStation2) 66.99)
	(= (slew_time GroundStation2 Planet11) 66.99)
	(= (slew_time Planet11 Star3) 26.12)
	(= (slew_time Star3 Planet11) 26.12)
	(= (slew_time Planet11 Phenomenon4) 7.515)
	(= (slew_time Phenomenon4 Planet11) 7.515)
	(= (slew_time Planet11 Phenomenon5) 35.2)
	(= (slew_time Phenomenon5 Planet11) 35.2)
	(= (slew_time Planet11 Star6) 96.52)
	(= (slew_time Star6 Planet11) 96.52)
	(= (slew_time Planet11 Phenomenon7) 28.86)
	(= (slew_time Phenomenon7 Planet11) 28.86)
	(= (slew_time Planet11 Planet8) 82.9)
	(= (slew_time Planet8 Planet11) 82.9)
	(= (slew_time Planet11 Planet9) 46.73)
	(= (slew_time Planet9 Planet11) 46.73)
	(= (slew_time Planet11 Phenomenon10) 15.15)
	(= (slew_time Phenomenon10 Planet11) 15.15)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite1 Planet11)
	(have_image Star3 spectrograph0)
	(have_image Phenomenon4 image1)
	(have_image Phenomenon5 infrared2)
	(have_image Star6 infrared2)
	(have_image Phenomenon7 image1)
	(have_image Planet8 infrared2)
	(have_image Phenomenon10 spectrograph0)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite1 phenomenon4 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 187 to 182.99, (fuel-used) from 0 to 4.01
   goals met: 0 of 8
2. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 8
3. (turn_to satellite0 groundstation2 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 157 to 104.95, (fuel-used) from 4.01 to 56.06
   goals met: 0 of 8
4. (turn_to satellite1 star0 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 182.99 to 177.484, (fuel-used) from 56.06 to 61.566
   goals met: 0 of 8
5. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 8
6. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 0 of 8
7. (turn_to satellite0 star6 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 104.95 to 52.9, (fuel-used) from 61.566 to 113.616
   goals met: 0 of 8
8. (take_image satellite0 star6 instrument1 infrared2)
   added: (have_image star6 infrared2)
   changed: (data_capacity satellite0) from 1000 to 833, (data-stored) from 0 to 167
   goals met: 1 of 8
9. (turn_to satellite0 phenomenon7 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 52.9 to 48.997, (fuel-used) from 113.616 to 117.519
   goals met: 1 of 8
10. (calibrate satellite1 instrument4 star0)
   added: (calibrated instrument4)
   goals met: 1 of 8
11. (switch_off instrument4 satellite1)
   deleted: (power_on instrument4)
   added: (power_avail satellite1)
   goals met: 1 of 8
12. (switch_on instrument5 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument5)
   goals met: 1 of 8
13. (calibrate satellite1 instrument5 star0)
   added: (calibrated instrument5)
   goals met: 1 of 8
14. (switch_off instrument5 satellite1)
   deleted: (power_on instrument5)
   added: (power_avail satellite1)
   goals met: 1 of 8
15. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 8
16. (calibrate satellite1 instrument3 star0)
   added: (calibrated instrument3)
   goals met: 1 of 8
17. (turn_to satellite1 phenomenon10 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon10)
   changed: (fuel satellite1) from 177.484 to 114.174, (fuel-used) from 117.519 to 180.829
   goals met: 1 of 8
18. (take_image satellite1 phenomenon10 instrument3 spectrograph0)
   added: (have_image phenomenon10 spectrograph0)
   changed: (data_capacity satellite1) from 1000 to 832, (data-stored) from 167 to 335
   goals met: 2 of 8
19. (turn_to satellite1 phenomenon4 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 114.174 to 110.164, (fuel-used) from 180.829 to 184.839
   goals met: 2 of 8
20. (take_image satellite1 phenomenon4 instrument3 image1)
   added: (have_image phenomenon4 image1)
   changed: (data_capacity satellite1) from 832 to 765, (data-stored) from 335 to 402
   goals met: 3 of 8
21. (turn_to satellite1 star3 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 star3)
   changed: (fuel satellite1) from 110.164 to 86.234, (fuel-used) from 184.839 to 208.769
   goals met: 3 of 8
22. (take_image satellite1 star3 instrument3 spectrograph0)
   added: (have_image star3 spectrograph0)
   changed: (data_capacity satellite1) from 765 to 563, (data-stored) from 402 to 604
   goals met: 4 of 8
23. (turn_to satellite1 planet8 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 planet8)
   changed: (fuel satellite1) from 86.234 to 83.408, (fuel-used) from 208.769 to 211.595
   goals met: 4 of 8
24. (take_image satellite1 planet8 instrument3 infrared2)
   added: (have_image planet8 infrared2)
   changed: (data_capacity satellite1) from 563 to 364, (data-stored) from 604 to 803
   goals met: 5 of 8
25. (turn_to satellite1 phenomenon5 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 phenomenon5)
   changed: (fuel satellite1) from 83.408 to 83.2776, (fuel-used) from 211.595 to 211.725
   goals met: 5 of 8
26. (take_image satellite1 phenomenon5 instrument3 infrared2)
   added: (have_image phenomenon5 infrared2)
   changed: (data_capacity satellite1) from 364 to 188, (data-stored) from 803 to 979
   goals met: 6 of 8
27. (turn_to satellite1 planet11 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 planet11)
   changed: (fuel satellite1) from 83.2776 to 48.0776, (fuel-used) from 211.725 to 246.925
   goals met: 7 of 8
28. (take_image satellite0 phenomenon7 instrument1 image1)
   added: (have_image phenomenon7 image1)
   changed: (data_capacity satellite0) from 833 to 645, (data-stored) from 979 to 1167
   goals met: 8 of 8
